//Написать программу вычисления значения функции y = sin(a). (Класс Math).
//cделанно, закоммить
System.Console.WriteLine("Введите значение: ");
double a=Convert.ToDouble(Console.ReadLine());
double y=Math.Sin(a);
System.Console.WriteLine("Значение Sin= "+y);