// 80. Вывести на экран кодировку символов по ASCII(с 32 до 122)

for (char c = '\u0032'; c <= '\u0122'; c++)
{
    Console.Write(c);
    //Console.WriteLine();
}